// 2024年の祝日データ
export const holidays2024 = {
  '1-1': '元日',
  '1-8': '成人の日',
  '2-11': '建国記念の日',
  '2-12': '建国記念の日 振替休日',
  '2-23': '天皇誕生日',
  '3-20': '春分の日',
  '4-29': '昭和の日',
  '5-3': '憲法記念日',
  '5-4': 'みどりの日',
  '5-5': 'こどもの日',
  '5-6': 'こどもの日 振替休日',
  '7-15': '海の日',
  '8-11': '山の日',
  '8-12': '山の日 振替休日',
  '9-16': '敬老の日',
  '9-23': '秋分の日',
  '10-14': 'スポーツの日',
  '11-3': '文化の日',
  '11-23': '勤労感謝の日'
};

// 2025年の祝日データ
export const holidays2025 = {
  '1-1': '元日',
  '1-13': '成人の日',
  '2-11': '建国記念の日',
  '2-23': '天皇誕生日',
  '2-24': '天皇誕生日 振替休日',
  '3-20': '春分の日',
  '4-29': '昭和の日',
  '5-3': '憲法記念日',
  '5-4': 'みどりの日',
  '5-5': 'こどもの日',
  '5-6': 'こどもの日 振替休日',
  '7-21': '海の日',
  '8-11': '山の日',
  '9-15': '敬老の日',
  '9-23': '秋分の日',
  '10-13': 'スポーツの日',
  '11-3': '文化の日',
  '11-23': '勤労感謝の日',
  '11-24': '勤労感謝の日 振替休日'
};

export const isHoliday = (date: Date): string | null => {
  const year = date.getFullYear();
  const month = date.getMonth() + 1;
  const day = date.getDate();
  const key = `${month}-${day}`;

  if (year === 2024) {
    return holidays2024[key] || null;
  } else if (year === 2025) {
    return holidays2025[key] || null;
  }
  return null;
};
